pmorgantech/WaveX/firmware/esp32/tests/unit/ui/file_browser_test.cpp
    wavex_file_browser_set_selection(browser, 5);

    EXPECT_EQ(5u, browser->selected_index);

    DestroyBrowser(browser);
}

// Test: Set selection with invalid index (should be ignored)
TEST_F(FileBrowserTest, SetSelectionInvalidIndex) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 0;

    wavex_file_browser_set_selection(browser, 20);  // Invalid index

    EXPECT_EQ(0u, browser->selected_index);  // Should remain unchanged

    DestroyBrowser(browser);
}

// Test: Get selected entry
TEST_F(FileBrowserTest, GetSelectedEntry) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 3;

    const wavex_file_entry_t* entry = wavex_file_browser_get_selected(browser);

    ASSERT_NE(entry, nullptr);
    EXPECT_STREQ("file03.wav", entry->name);

    DestroyBrowser(browser);
}

// Test: Get selected index
TEST_F(FileBrowserTest, GetSelectedIndex) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 7;

    uint32_t index = wavex_file_browser_get_selected_index(browser);

    EXPECT_EQ(7u, index);

    DestroyBrowser(browser);
}

// Test: Viewport scrolling when selection moves above visible area
TEST_F(FileBrowserTest, ViewportScrollUp) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 20);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 10;
    browser->first_visible_index = 10;
    browser->visible_count = 8;

    // Move selection up above visible area
    browser->selected_index = 5;
    wavex_file_browser_set_selection(browser, 5);

    EXPECT_EQ(5u, browser->first_visible_index);  // Viewport should scroll up

    DestroyBrowser(browser);
}

// Test: Viewport scrolling when selection moves below visible area
TEST_F(FileBrowserTest, ViewportScrollDown) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 20);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 5;
    browser->first_visible_index = 5;
    browser->visible_count = 8;

    // Move selection down below visible area
    browser->selected_index = 15;
    wavex_file_browser_set_selection(browser, 15);

    // Viewport should scroll down to show selected entry
    uint32_t expected_first_visible = 15 - (browser->visible_count - 1);
    EXPECT_EQ(expected_first_visible, browser->first_visible_index);

    DestroyBrowser(browser);
}

// Test: Navigate to path
TEST_F(FileBrowserTest, NavigateToPath) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 5);
    ASSERT_NE(browser, nullptr);

    // The return value was previously computed and discarded, so the
    // function's contract in the mocked environment was untested and a change
    // to it could not fail anything. Pin it: the listing refresh needs
    // inter-MCU traffic that the mock does not answer, so the call reports
    // failure while still having updated the path.
    const bool result = wavex_file_browser_navigate_to(browser, "/SOUNDS");
    EXPECT_FALSE(result) << "navigate_to unexpectedly reported success without a browse response";
    EXPECT_STREQ("/SOUNDS", browser->current_path);

    DestroyBrowser(browser);
}

// Test: Multiple navigate down operations
TEST_F(FileBrowserTest, MultipleNavigateDown) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 0;

    // Navigate down 5 times
    for (int i = 0; i < 5; i++) {
        bool result = wavex_file_browser_navigate_down_entry(browser);
        EXPECT_TRUE(result);
        EXPECT_EQ((uint32_t)(i + 1), browser->selected_index);
    }

    EXPECT_EQ(5u, browser->selected_index);

    DestroyBrowser(browser);
}

// Test: Multiple navigate up operations
TEST_F(FileBrowserTest, MultipleNavigateUp) {
    wavex_file_browser_t* browser = CreateMinimalBrowser("/", 10);
    ASSERT_NE(browser, nullptr);
    browser->selected_index = 9;

    // Navigate up 5 times
    for (int i = 0; i < 5; i++) {
        bool result = wavex_file_browser_navigate_up_entry(browser);
        EXPECT_TRUE(result);
        EXPECT_EQ((uint32_t)(9 - i - 1), browser->selected_index);
    }

    EXPECT_EQ(4u, browser->selected_index);

    DestroyBrowser(browser);
}

// ===========================================================================
// Browse-response path: a browser created over a REAL CommInterfaceImpl and
// StatisticsManager, fed real wire payloads through the same listener slot
// production uses. This exercises file_browser.cpp's response parsing,
// pagination, ".." sorting, and truncation handling - the logic the
// navigation tests above cannot reach.
// ===========================================================================

using WaveX::Protocol::BrowseRespHeader;
using WaveX::Protocol::FileEntryWire;
using WaveX::Test::GetInterMcuCapture;
using WaveX::Test::ResetInterMcuCapture;

namespace {

std::vector<uint8_t> BuildBrowsePayload(uint32_t total_count,
                                        const std::vector<FileEntryWire>& entries) {
    BrowseRespHeader header(total_count, static_cast<uint8_t>(entries.size()));
    std::vector<uint8_t> payload(sizeof(header) + entries.size() * sizeof(FileEntryWire));
    memcpy(payload.data(), &header, sizeof(header));
    if (!entries.empty()) {
        memcpy(payload.data() + sizeof(header),
               entries.data(),
               entries.size() * sizeof(FileEntryWire));
    }
    return payload;
}

}  // namespace

class FileBrowserResponseTest : public ::testing::Test {
   protected:
    void SetUp() override {
        ResetInterMcuCapture();
        stats_ = new StatisticsManager();
        comm_ = new WaveX::Comm::CommInterfaceImpl(*stats_);

        config_ = wavex_file_browser_config_t{};
        config_.root_path = "/";
        config_.filter = WaveX::Protocol::BrowseFilter::Samples;
        config_.max_entries = WaveX::Protocol::BROWSE_DIRECTORY_ENTRY_LIMIT;
        config_.show_hidden = false;
        config_.comm_interface = comm_;

        browser_ = wavex_file_browser_create(reinterpret_cast<lv_obj_t*>(&parent_), &config_);
        ASSERT_NE(browser_, nullptr);
    }

    void TearDown() override {
        if (browser_) {
            wavex_file_browser_destroy(browser_);
        }
        delete comm_;
        comm_ = nullptr;
        delete stats_;
        stats_ = nullptr;
    }

